/**
	*	@file
	*	@brief Структуры и функции для работы с клиентами. Заголовок.
	*	@author Кузнецов Егор Ильич goga.petrovich12@gmail.com
	*	@version 1.0.0
	*	@date 29.11.2025
*/

//----------------------------------------------------------------
//  Автор
//----------------------------------------------------------------
//    Кузнецов Егор Ильич
//    goga.petrovich12@gmail.com
//----------------------------------------------------------------
//	29.11.2025
//----------------------------------------------------------------
#ifndef	CLIENT_H
#define	CLIENT_H
//----------------------------------------------------------------
//  Заголовки
//----------------------------------------------------------------
//		C Linux заголовки
//----------------------------------------------------------------
	#include	<netinet/in.h>
//----------------------------------------------------------------
//	Структуры данных
//----------------------------------------------------------------
		/*	@brief	Клиент. */
		typedef	struct	_Client
		{
			/*	@brief	Информация о клиенте в формате IPv4. */
			struct sockaddr_in	info;

			/*	@brief	Размер информации о клиенте. */
			socklen_t	lenInfo;
		}	Client;
//----------------------------------------------------------------

#endif
